# ElectricalLighting Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
GroupTypeId..::..ElectricalLighting Property
GroupTypeId Class See Also
---
"Electrical - Lighting"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ElectricalLighting { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElectricalLighting As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ElectricalLighting {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace